const withdraw = function(amount, balance) {
    /*
     * Перевіряється умова. Якщо воно виконується, відбувається
     * console.log і вихід з функції. Код йде після тіла if
     * не виконається.
     */
    if (amount === 0) {
      console.log('Для проведення операції введіть суму більше нуля.');
      return;
    }
  
    /*
     * Якщо умова першого if не виконалася, його тіло пропускається
     * і інтерпретатор доходить до цього if.
     * Перевіряється умова. Якщо воно виконується, відбувається
     * console.log і вихід з функції. Код йде після тіла if
     * не виконається.
     */
    if (amount > balance) {
      console.log('Недостатньо коштів на рахунку.');
      return;
    }
  
    /*
     * Якщо жоден з попередніх if не виконався,
     * інтерпретатор доходить до цього коду і виконує його.
     */
    console.log('Операція зняття коштів проведена.');
  };
  
  withdraw(0, 300); // Для проведення операції введіть суму більше нуля.
  withdraw(500, 600); // Недостатньо коштів на рахунку.
  withdraw(100, 300); // Операція зняття коштів проведена.